<template>
    <div class="service-terms">
      <h3>⽤户服务协议和隐私政策</h3>
      <p>《⽤户服务协议和隐私政策》（以下简称“协议”）及其条款，系您注册、使用臻善应用快速构建平台软件（以下简称“本软件”）所订⽴的、描述您与本软件之间权利义务的协议。在注册前务必认真阅读本协议的内容、充分理解各条款内容，如有异议，您可选择不进⼊本软件。⼀旦您确认本⽤户注册协议后，本协议即在您和本软件之间产⽣法律效⼒，意味着您完全同意并接受协议的全部条款。请您审慎阅读并选择接受或不接受协议（未成年⼈应在法定监护⼈陪同下阅读）。</p>
      <h5>⽤户使⽤：</h5>
      <p>⽤户按照页⾯给与的提⽰完成全部注册步骤后，即成为本软件的⽤户，⽤户应⾃⾏保管账号及密码，并准确、安全地使⽤其账号及密码。本软件可通过⽤户⾃⾏设定，向⽤户提供个性化信息服务。</p>
      <p>⽤户充分了解并同意，本软件为⽤户提供个性化信息服务，⽤户须为⾃⼰注册账号下的⾏为负责，包括⽤户所导⼊、上载、传送的任何内容以及由此产⽣的任何后果，⽤户应对本软件中的内容⾃⾏加以判断，并承担因使⽤内容⽽引起的所有风险。本软件不对因⽤户⾏为⽽导致的损失承担责任。</p>
      <p>⽤户须对在本软件上所传送信息的真实性、合法性、有效性等负责，与⽤户所传播的信息相关的任何法律责任由⽤户⾃⾏承担，与本软件⽆关。⽤户在本软件中记录的或通过本软件服务所传送的任何内容并不反映本软件的观点或政策，本软件对此不承担责任。</p>
      <p>⽤户提供的个⼈信息或发布的信息不真实、不准确、不合法；发表内容不符合本协议或发表内容不符合法律法规的，本软件有权暂停或终⽌⽤户使⽤本平台的服务。⽤户如果对本软件的暂停或者终⽌或收回其账号⾏为有异议，客户可向平台提出意见，要求其继续提供服务。本软件收到客户此类信息的投诉与意见，会审核相关信息，并及时对⽤户给予反馈。若信息确实不真实或不准确或不合法有效，本软件平台要求⽤户提供符合要求的信息。</p>
      <p>为避免⽤户终端数据丢失、更好服务⽤户之⽬的，本软件将向注册⽤户提供数据备份服务，经注册⽤户授权，本软件将存储于注册⽤户终端的本软件数据库中的数据资料上载⾄本软件服务器，并且提供恢复到终端设备服务。</p>
      <h5>⽤户不得利⽤本软件服务制作、上载、复制、发布、传播或者转载如下内容：</h5>
      <p>反对宪法所确定的基本原则的；</p>
      <p>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统⼀的；</p>
      <p>损害国家荣誉和利益的；</p>
      <p>煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>散布谣⾔，扰乱社会秩序，破坏社会稳定的；</p>
      <p>散布淫秽、⾊情、赌博、暴⼒、凶杀、恐怖或者教唆犯罪的；侮辱或者诽谤他⼈，侵害他⼈合法权益的；</p>
      <p>法律、⾏政法规禁⽌的其他内容。</p>
      <p>本软件有权针对⽤户发表的内容进⾏审核，若⽤户实施违反本条所述使⽤规则及法律法规的⾏为，本软件平台有权视⾏为严重程度，根据《侵权责任法》《信息⽹络传播权保护条例》等法律法规要求⽤户⽴即采取纠正、改正、恢复原状、消除影响等⾏为，且本软件有权⾃⾏采取合法有效且必要的措施（包括但不限于更改或删除相关侵权信息、暂停或终⽌⽤户使⽤本⽹络服务等），同时本软件保留进⼀步追究⽤户法律责任的权利。 </p>
      <p>同时，用户应当履⾏与本协议权利、法律法规相适应的义务，对违反法律规定和协议约定、履⾏责任义务不到位的服务提供者应当依法依约限制（更改或删除相关侵权信息、暂停使⽤）或取消其相关权限，直⾄封禁或者关闭有关账号。</p>
      <p> 本软件保留因业务发展需要，单⽅⾯对其服务器所提供的全部或部分服务内容在任何时候不经任何通知的情况下变更、暂停、限制、终⽌或撤销服务的权利。</p>
      <h5>隐私政策：</h5>
      <p>本软件尊重并保护所有使⽤服务⽤户的个⼈隐私权，⾼度重视⽤户的隐私及个⼈信息的保护，本隐私政策帮助您了解我们收集哪些数据、为什么收集这些数据，会利⽤这些数据做些什么及如何保护这些数据。</p>
      <p>我们将依据《中华⼈民共和国⽹络安全法》、《信息安全技术个⼈信息安全规范》以及其他相关法律法规、业界成熟的安全标准收集和本协议的约定使⽤您的个⼈信息，除本隐私权政策另有规定外，在未征得您事先许可的情况下，本软件不会将这些信息对外披露或向第三⽅提供。</p>
      <p>收集和使⽤个⼈信息的范围。注册账号：您注册并登录本软件账号时⾄少向我们提供账号名称、⼿机号码或电⼦邮箱等内容，并创建密码。注册成功后，您提供的上述信息，将在您使⽤本软件平台和服务期间持续授权我们使⽤。在您注销账号时，我们将停⽌使⽤并删除上述信息或对您的个⼈信息进⾏匿名化处理，法律法规另有规定的除外。</p>
      <p>同时使⽤⼿机号码注册成功后，我们可能收集如下信息：设备信息：以便我们能在设备上为您提供服务，设备状态信息、设备链接信息。⾝份认证服务：本软件提供⾝份认证服务，当您申请成为本软件⽤户为您进⾏⾝份认证时我们需要收集您的出⽣⽇期、时间、出⽣地点有关⾝份证明的信息。</p>
      <p>按照法律法规要求，下列如下情况我们将⽆法满⾜您的上述请求：与国家安全、国家利益相关的；与公共安全、公共利益相关的；与您或者第三⽅重⼤利益相关并可能会导致严重损害的；与犯罪、司法程序、政府程序等直接相关的；您存在主观恶意或滥⽤权利的（如您的请求将危害公共安全和其他⼈合法权益，或您的请求超出了⼀般技术⼿段和商业成本可覆盖的范围）；涉及商业秘密的；我们如何保护您的个⼈信息为防⽌您的信息丢失、未经您同意授权的访问、公开披露、泄露、转让等导致您个⼈信息的受损，本软件平台将采取⼀切合理、可靠、可⾏的⽅案与措施，保障您的个⼈信息安全。</p>
      <p>如果您注销帐户后，我们不会再对您的个⼈信息进⾏使⽤，我们将依据⽹络安全法等法律法规规定保存您的信息并进⾏匿名化处理。</p>
      <p>如果决定更改隐私政策，我们会在本政策中及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使⽤您的个⼈信息，哪些⼈可以访问这些信息，以及在什么情况下我们会透露这些信息。</p>
      <p>您管理个⼈信息的权利我们⾮常重视您对个⼈信息的关注，并尽全⼒保护您对于⾃⼰个⼈信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能⼒保障您的隐私和安全。</p>
      <p>未成年⼈个⼈信息：若您是未成年⼈，建议您的监护⼈仔细阅读本隐私保护条例的条款，并在征得您的监护⼈同意的前提下使⽤我们的产品和服务或向我们提供信息。如您的监护⼈不同意您使⽤我们的服务或向我们提供信息，请您⽴即终⽌使⽤我们的服务并及时通知我们，以便我们采取相应的措施。如果监护⼈发现我们在未获监护⼈同意的情况下收集了未成年⼈的个⼈信息，请监护⼈反馈联系我们，我们在核准相关情况后尽快删除您的个⼈数据。</p>
      <h5>法律责任与免责：</h5>
      <p>本软件平台对平台进⾏停机维护、定期检查、更新软硬件、针对突发事件、不可抗⼒、电脑病毒、系统故障等因素导致的正常服务中断、中⽌，本软件不承担责任，本软件平台将尽⼒避免服务中断并将中断时间限制在最短时间内。</p>
      <p>⽤户因第三⽅如电信部门的通讯线路故障、技术问题、⽹络、电脑故障、系统不稳定性及其他各种不可抗⼒原因⽽遭受的⼀切损失，本软件不承担责任。</p>
      <p>因⽤户违反本协议或相关的服务条款的规定，导致或产⽣的任何第三⽅向本软件主张的索赔，由⽤户⾃⾏承担。</p>
      <p>由于您的隐私权对本⽹站相当重要，除⾮有权机关依法调取或者第三条约定，本软件平台不会⽆故把您的个⼈信息提供给⽆关的第三⽅，但不对第三⼈恶意侵权导致信息泄露⽽产⽣的后果负责。</p>
      <h5>知识产权：</h5>
      <p>本软件的⼀切知识产权，以及与软件相关的所有信息内容，包括但不限于：⽂字表述及其组合、图标、图饰、图像、图表、⾊彩、界⾯设计、版⾯框架、有关数据、附加程序、印刷材料或电⼦⽂档等均归本软件所有，受著作权法和国际著作权条约以及其他知识产权法律法规的保护。未经本软件书⾯同意，⽤户不得为任何营利性或⾮营利性的⽬的⾃⾏实施、利⽤、转让或许可任何三⽅实施、利⽤、转让上述知识产权。出现上述未经许可之⾏为时，本软件保留追究相关责任⼈法律责任之权利。</p>
      <h5>修改与解释权：</h5>
      <p>根据互联⽹的发展和有关法律、法规及规范性⽂件的变化，或者因业务发展需要，本软件有权对本协议的条款作出修改或变更，⼀旦本协议的内容发⽣变动，您可在本软件官⽅⽹站查阅最新版协议条款，该公布⾏为视为本软件已经通知⽤户修改内容，⽽不另⾏对⽤户进⾏个别通知。在本软件修改协议条款后，如果您不接受修改后的条款，请⽴即停⽌使⽤本软件提供的服务，您继续使⽤本软件提供的服务将被视为已接受了修改后的协议。</p>
      <h5>法律适⽤、管辖与其他：</h5>
      <p>本软件郑重提醒⽤户注意本协议中可能存在的免除本软件责任和加重⽤户义务的条款，请⽤户仔细阅读，⾃主考虑风险。本协议之订⽴、⽣效、解释、修订、补充、终⽌、执⾏与争议解决均适⽤中华⼈民共和国法律；如法律⽆相关规定的，参照商业惯例或⾏业惯例。与本协议、使⽤本软件发⽣的任何争议或纠纷，双⽅应尽量友好协商解决；协商不成时，任何⼀⽅均有权将纠纷交由⼈民法院管辖。本协议任⼀条款被视为废⽌、⽆效或不可执⾏，该条应视为可分的且并不影响本协议其余条款的有效性及可执⾏性。</p>
    </div>
</template>

<script>
    export default {
        name: "serviceTerms.vue"
    }
</script>

<style lang="scss" scoped>
  .service-terms{
    h3{
      line-height:50px;
      font-size: 24px;
      text-align: center;
      margin-bottom: 10px;
    }
    h5{
      line-height:34px;
      font-size: 16px;
    }
    p{
      line-height:26px;
      text-indent: 1em;
    }
  }

</style>
